![]()

# SQL - Zaawansowany

_Mikołaj Leszczuk_

* Operacje na stringach
* Łączenie tabel i wyszukiwanie danych w wielu tabelach
* Zadania utrwalające 2
* Pod-zapytania
* Zadania utrwalające 3

## Operacje na stringach

Tu doświadczymy istotnych różnic pomiędzy implementacjami DBMS!

In [ ]:
%CREATE osoby.db

In [ ]:
%LOAD osoby.db rw

In [ ]:
CREATE TABLE "osoby" (
    "imię"     VARCHAR,
    "nazwisko" VARCHAR,
    "wiek"     TINYINT
);

In [ ]:
INSERT INTO osoby VALUES ("Paweł", "Kowalski", 3);

In [ ]:
INSERT INTO osoby VALUES ("Piotr", "Janik", 7);

In [ ]:
INSERT INTO osoby VALUES ("Michał", "Nowak", 13);

In [ ]:
SELECT * FROM osoby;

### `CONCAT()`

Czasem jest potrzeba wyświetlenia konkatenacji kolumn i jakiegoś łańcucha tekstowego. Do tego może przydać się funkcja `CONCAT()`.

Składnia operatora konkatenacji różni się od siebie w bazach danych:

* Oracle: `CONCAT()` lub `||`
* MySQL: `CONCAT()`
* SQL Server: `+`
* SQLite: `||`

### Składnia dla MySQL/Oracle

```mysql
SELECT CONCAT(nazwa_kolumny1,nazwa_kolumny2) FROM nazwa_tabeli;
```

#### Przykład

```mysql
CONCAT()
```

**Wyświetl tekst powstały z połączenia imienia z nazwiskiem**

Tabela **``Osoby``**:

In [ ]:
SELECT * FROM osoby;

Zapytanie i wynik zapytania SQLite:

In [ ]:
SELECT CONCAT(imię,nazwisko) FROM osoby;

Zapytanie i wynik zapytania MySQL/Oracle:

```mysql
SELECT CONCAT(imię,nazwisko) FROM osoby;
```

|     CONCAT(imię,nazwisko)    |
|:----------------------------:|
|     PawełKowalski            |
|     PiotrJanik               |
|     MichałNowak              |

W Oracle funkcja `CONCAT()` przyjmuje wyłącznie 2 argumenty. Problem można ominąć używając operatora `||` dostępnego tylko w Oracle i SQLite.

### Składnia użycia operatora `||` w Oracle/SQLite

```sql
SELECT 'dowolny_tekst'||nazwa_kolumny1||'dowolny_tekst'||nazwa_kolumny2 FROM nazwa_tabeli;
```

#### Przykład

Użycie `||` w Oracle/SQLite

**Wyświetl imię i nazwisko oddzielone spacją `(" ")`**

Tabela **`Osoby`**:

In [ ]:
SELECT * FROM osoby;

Zapytanie i wynik zapytania:

In [ ]:
SELECT imię||' '||nazwisko FROM osoby;

### Składnia dla SQL Server

```sql
SELECT 'dowolny_tekst'+nazwa_kolumny1+'dowolny_tekst'+ nazwa_kolumny2 FROM nazwa_tabeli;
```

#### Przykład

Użycie `+` w SQL Server

**Wyświetl imię i nazwisko oddzielone spacją `(" ")`**

Tabela **`Osoby`**:

In [ ]:
SELECT * FROM osoby;

Zapytanie i wynik zapytania SQLite:

In [ ]:
SELECT imię+' '+nazwisko FROM osoby;

Zapytanie i wynik zapytania SQL Server:

```sql
SELECT imię+' '+nazwisko FROM osoby;
```

|     imię+' '+nazwisko    |
|:------------------------:|
|     Paweł   Kowalski     |
|     Piotr   Janik        |
|     Michał   Nowak       |

#### Ćwiczenie

**Wyświetl bez powtórzeń imię i nazwisko oddzielone spacją `(" ")`**

Tabela **`Simple_library_db`**:

[02 SQL - Reset.ipynb](02%20SQL%20-%20Reset.ipynb)

In [ ]:
%LOAD simple_library_db.db rw

In [ ]:
SELECT * FROM simple_library_db;

Wpisz zapytanie do bazy!

---

Zapytanie i wynik zapytania:

In [ ]:
SELECT DISTINCT author_name||' '|| author_surname FROM simple_library_db;

### `LOWER(nazwa_kolumny)` i `UPPER(nazwa_kolumny)`

Funkcja zwraca wartość kolumny tekstowej w postaci małych/dużych liter.

Składnia:

```sqlite
SELECT LOWER(nazwa_kolumny) FROM nazwa_tabeli;
```

```sqlite
SELECT UPPER(nazwa_kolumny) FROM nazwa_tabeli;
```

#### Przykład

```sql
LOWER()
```

**Wyświetl wszystkie nazwiska małymi literami**

Tabela **`Osoby`**:

In [ ]:
%LOAD osoby.db rw

In [ ]:
SELECT * FROM osoby;

Zapytanie i wynik zapytania:

In [ ]:
SELECT LOWER(nazwisko) FROM osoby;

#### Przykład

```sql
UPPER()
```

**Wyświetl wszystkie nazwiska dużymi literami**

Tabela **`Osoby`**:

In [ ]:
SELECT * FROM osoby;

Zapytanie i wynik zapytania:

In [ ]:
SELECT UPPER(nazwisko) FROM osoby;

#### Ćwiczenie

**Wyświetl bez powtórzeń imię małymi literami i nazwisko dużymi literami**

Tabela **`Simple_library_db`**:

In [ ]:
%LOAD simple_library_db.db rw

In [ ]:
SELECT * FROM simple_library_db;

Wpisz zapytanie do bazy!

---

Zapytanie i wynik zapytania:

In [ ]:
SELECT DISTINCT LOWER(author_name), UPPER(author_surname) FROM simple_library_db;

### `LENGTH(nazwa_kolumny)`

Funkcja zwraca długość pola tekstowego podanego jako argument

Składnia:

```sqlite
SELECT LENGTH(nazwa_kolumny) FROM nazwa_tabeli;
```

W SQL Server używa się do tego samego funkcji `LEN()`

#### Przykład

```sql
LENGTH()
```

**Wyświetl nazwisko i odpowiadającą jemu długość nazwiska**

Tabela **`Osoby`**:

In [ ]:
%LOAD osoby.db rw

In [ ]:
SELECT * FROM osoby;

Zapytanie i wynik zapytania:

In [ ]:
SELECT nazwisko,LENGTH(nazwisko) FROM osoby;

### `REPLACE(str1,str2,str3)`

Funkcja przeszukuje `str1` w poszukiwaniu `str2` aby go zamienić na `str3`

Składnia:

```sqlite
SELECT REPLACE(nazwa_kolumny,'str2','str3') FROM nazwa_tabeli;
```

#### Przykład

```sql
REPLACE()
```

**Wyświetl imiona i nazwiska z tym że zamiast imienia Michał wyświetl Michael**

Tabela **`Osoby`**:

In [ ]:
SELECT * FROM osoby;

Zapytanie i wynik zapytania:

In [ ]:
SELECT REPLACE(imię,'Michał','Michael'), nazwisko FROM osoby;

### `SUBSTR(nazwa_kolumny,pozycja[,liczba_znaków])`

Funkcja ta służy do operacji na łańcuchach tekstowych w wyniku zapytań. Może przyjmować 2-3 argumentów.

```sql
SUBSTR(nazwa_kolumny,pozycja[,liczba_znaków])
```

`nazwa_kolumny` - łańcuch tekstowy do obcięcia

`pozycja` - nr znaku od którego ma być wyświetlony string

`liczba_znaków` - argument opcjonalny, ilość znaków do wyświetlenia, liczona od parametru pozycja

W Oracle oraz w niektórych wersjach MySQL używa się funkcji `SUBSTRING()`

Natomiast w MS Access stosuje się `MID()`

Składnia:

```sqlite
SELECT SUBSTR(nazwa_kolumny,pozycja[,liczba_znaków]) FROM nazwa_tabeli;
```

#### Przykład

```sqlite
SUBSTR()
```

**Wyświetl dwie pierwsze litery z nazwiska**

Tabela **`Osoby`**:

In [ ]:
SELECT * FROM osoby;

Zapytanie i wynik zapytania:

In [ ]:
SELECT SUBSTR(nazwisko,1,2) FROM osoby;

## Łączenie tabel i wyszukiwanie danych w wielu tabelach

Czasem potrzebujemy wybrać dane z tabeli w zależności od danych pochodzących z innej tabeli. Do rozwiązania tego problemu służy operacja zwana **łączeniem (`JOIN`)**.

Jeśli w zapytaniu potrzebne nam są dane z `tabeli1` i `tabeli2` to musimy wpisać ich nazwy zaraz po słowie `FROM` (tak jak to robimy w standardowych zapytaniach) a następnie odwoływać się do kolumn z tych tabel używając: nazwy konkretnej tabeli, operatora kropki “`.`” oraz nazwy żądanej kolumny.

```sqlite
SELECT tabela.kolumna,tabela2.kolumna FROM tabela,tabela2 WHERE tabela2.kolumna=tabela.kolumna
```

Operator “`,`” jest skrótem od słowa kluczowego `JOIN`, które oznacza zebranie wymienionych tabel w jedną dużą i operowanie na niej.

Możliwe jest łączenie trzech i więcej tabel. Działa to analogicznie jak w przypadku dwóch tabel.

`JOIN` łączy rekordy z dwóch kolumn w jeden na podstawie podanego warunku

#### Przykład

**Łączymy rekordy z tabel `Authors` i `Titles` w jedną tabelę na podstawie podanego warunku równości `authors.id` i `titles.author_id`**

Tabela **`Authors`**:

In [ ]:
%LOAD library_db.db rw

In [ ]:
SELECT * FROM authors;

Tabela **`Titles`**:

In [ ]:
SELECT * FROM titles;

Zapytanie i wynik zapytania:

In [ ]:
SELECT * FROM authors JOIN titles ON authors.ID==titles.author_id;

#### Ćwiczenie

**Znajdź nazwisko i tytuły książek napisanych przez autora o identyfikatorze 3**

Tabela **`Titles`**:

In [ ]:
SELECT * FROM titles;

Tabela **`Authors`**:

In [ ]:
SELECT * FROM authors;

Wpisz zapytanie do bazy!

---

Zapytanie i wynik zapytania:

In [ ]:
SELECT authors.surname,titles.title FROM authors JOIN titles ON authors.ID=titles.author_id
WHERE titles.author_id="3";

#### Ćwiczenie

**Znajdź imiona, nazwiska i tytuły książek napisanych przez autorów o imieniu rozpoczynającym się na “`S`”**

Tabela **`Titles`**:

In [ ]:
SELECT * FROM titles;

Tabela **`Authors`**:

In [ ]:
SELECT * FROM authors;

Wpisz zapytanie do bazy!

---

Zapytanie i wynik zapytania:

In [ ]:
SELECT authors.name,authors.surname,titles.title FROM authors JOIN titles ON authors.ID=titles.author_id
WHERE authors.name LIKE 'S%';

### Łączenie tabel z użyciem aliasów

```sql
SELECT tab.kolumna FROM tabela AS tab,tabela2 AS tab2 WHERE tab2.kolumna=wartość;
```

#### Przykład

**Podajemy id, nazwę i ilość zamówionych produktów w zamówieniu o id `4` korzystając z aliasów dla tabel `Order_product` i `Product`**

Tabela **`Order_product`**:

In [ ]:
%LOAD CodeBrainers.db rw

In [ ]:
SELECT * FROM order_product;

Tabela **`Product`**:

In [ ]:
SELECT * FROM product;

Zapytanie i wynik zapytania:

In [ ]:
SELECT p.id,p.name,op.amount FROM order_product AS op,product AS p WHERE op.order_id=4 AND p.id=op.product_id;

## Zadania utrwalające 2

### Ćwiczenia

[`02_joins.md`](https://github.com/pkociepka/sql/blob/master/exercises/02_joins.md)

### Materiały

[`library_db.sql`](https://github.com/pkociepka/sql/blob/master/library_db.sql)

Schemat bazy danych z pliku [`library_db.sql`](https://github.com/pkociepka/sql/blob/master/library_db.sql) znajdziesz w pliku [`library_db_scheme.png`](https://github.com/pkociepka/sql/blob/master/library_db_schema.png)

![](https://raw.githubusercontent.com/pkociepka/sql/master/library_db_schema.png)

## Pod-zapytania

Tworzenie podzapytania polega na zagnieżdżaniu zapytania w innym zapytaniu.

Aby je zagnieździć, wystarczy w miejscu, w którym oczekujemy zwróconej przez podzapytanie wartości, wstawić nawiasy i zapisać pomiędzy nimi zapytanie w takiej samej formie jak zwykłe zapytanie.

```sqlite
SELECT kolumna,kolumna2,.. FROM tabela WHERE kolumna=(SELECT kolumna FROM tabela2);
```

#### Przykład

**Wybieramy id, imię i nazwisko autora który napisał książkę o tytule “`Solaris`”**

Tabela **`Authors`**:

In [ ]:
%LOAD library_db.db rw

In [ ]:
SELECT * FROM authors;

Tabela **`Titles`**:

In [ ]:
SELECT * FROM titles;

Zapytanie i wynik zapytania:

In [ ]:
SELECT id,name,surname FROM authors WHERE id=(SELECT author_id FROM titles WHERE title='Solaris');

#### Ćwiczenie

**Wybierz id i nazwę produktów zamówionych w zamówieniu o id `2`**

Tabela **`Product`**:

In [ ]:
%LOAD CodeBrainers.db rw

In [ ]:
SELECT * FROM product;

Tabela **`Order_product`**:

In [ ]:
SELECT * FROM order_product;

Wpisz zapytanie do bazy!

---

Zapytanie i wynik zapytania:

In [ ]:
SELECT id,name FROM product WHERE id IN (SELECT product_id FROM order_product WHERE order_id=2);

Wynik każdego zapytania `SELECT` można traktować jak kolejną (wirtualną) tabelę. W efekcie możemy wykonywać na takiej tabeli zapytania.

* Pod-zapytania w `FROM`
* Pod-zapytania w `WHERE`
* Pod-zapytania w `SELECT`

### Podzapytania w `FROM`

#### Przykład

**Załóżmy, że mamy gotowe zapytanie o listę użytkowników biblioteki wraz z liczbą książek pożyczonych przez każdego z nich.**

Tabela **`Users`**:

In [ ]:
%LOAD library_db.db rw

In [ ]:
SELECT * FROM users;

Tabela **`Borrowings`**:

In [ ]:
SELECT * FROM borrowings;

Zapytanie i wynik zapytania:

In [ ]:
SELECT users.name, users.surname, COUNT(borrowings.ID) AS activity FROM users JOIN borrowings
ON users.ID=borrowings.user_id GROUP BY users.ID;

Na wyniku tego zapytania możemy wykonać kolejne zapytanie, by otrzymać listę użytkowników, którzy pożyczyli więcej niż 10 książek.

Zapytanie i wynik zapytania:

In [ ]:
SELECT * FROM
(
    SELECT users.name, users.surname, COUNT(borrowings.ID) AS activity FROM users JOIN borrowings
    ON users.ID=borrowings.user_id GROUP BY users.ID
)
WHERE activity>10;

### Podzapytania w `WHERE`

#### Przykład

**Zapytania zwracające w wyniku pojedynczą wartość możemy użyć np. w wyrażeniach warunkowych (`WHERE`, `HAVING`). Mając zapytanie o średnią liczbę wypożyczeń dokonanych przez użytkownika.**

Tabela **`Borrowings`**:

In [ ]:
SELECT * FROM borrowings;

Zapytanie i wynik zapytania:

In [ ]:
SELECT 1.0*COUNT(DISTINCT borrowings.ID)/COUNT(DISTINCT borrowings.user_id) FROM borrowings;

**Możemy napisać zapytanie zwracające listę użytkowników pożyczających więcej książek niż średnia.**

Tabela **`Users`**:

In [ ]:
SELECT * FROM users;

Zapytanie i wynik zapytania:

In [ ]:
SELECT users.name,users.surname, COUNT(borrowings.ID) AS books_borrowed FROM users JOIN borrowings 
ON users.ID=borrowings.user_id GROUP BY users.ID HAVING books_borrowed>
(
    SELECT 1.0*COUNT(DISTINCT borrowings.ID)/COUNT(DISTINCT borrowings.user_id) FROM borrowings
)
;

### Podzapytania w `SELECT`

#### Przykład

**Analogicznie do poprzedniego przypadku - jeśli podzapytanie zwraca pojedynczą wartość, możemy je użyć jako jedną z kolumn w głównym zapytaniu.**

Tabela **`Users`**:

In [ ]:
SELECT * FROM users;

Tabela **`Borrowings`**:

In [ ]:
SELECT * FROM borrowings;

Zapytanie i wynik zapytania:

In [ ]:
SELECT users.name,users.surname, 
(
    SELECT COUNT(borrowings.ID) FROM borrowings WHERE borrowings.user_id=users.ID
) 
AS books FROM users;

Co ważne - w podzapytaniu (w tym przypadku z tabeli **`Borrowings`**) możemy odwołać się do tabeli i pól z zapytania zewnętrznego (**`Users`**)

### Wydajność

Nie musimy się martwić o wydajność takich podzapytań - mimo że pozornie liczenie średniej liczby wypożyczeń powinno się wykonywać z osobna dla każdego rekordu użytkownika, baza danych optymalizuje plan zapytania. Jeśli chcemy sprawdzić, jak nasze zapytanie przekłada się na operacje wykonywane w bazie, możemy przed treścią zapytania dodać komendę `EXPLAIN QUERY PLAN` - zapytanie nie zostanie wtedy wykonane, otrzymamy jednak listę kroków, które baza danych chce wykonać.

#### Przykład

Zapytanie i wynik zapytania:

In [ ]:
EXPLAIN QUERY PLAN 
SELECT users.name, users.surname,COUNT(borrowings.ID) AS books_borrowed FROM users JOIN borrowings 
ON users.ID=borrowings.user_id GROUP BY users.ID HAVING books_borrowed>
(
    SELECT 1.0*COUNT(DISTINCT borrowings.ID)/count(DISTINCT borrowings.user_id) FROM borrowings
)
;

## Zadania utrwalające 3

### Ćwiczenia

[`03_subquerries.md`](https://github.com/pkociepka/sql/blob/master/exercises/03_subquerries.md)

### Materiały

[`library_db.sql`](https://github.com/pkociepka/sql/blob/master/library_db.sql)